# Seminar on Data Mining


## Literature:
https://jakevdp.github.io/PythonDataScienceHandbook/index.html

## Moodle - the Primary Communication Space:
https://dl1.cuni.cz/course/view.php?id=15921

## Expected Output for Credits:

You should submit and present a seminar work that presents your ability to use machine learning techniques to your own dataset. You select or get your own topic. The work should present at least 12 ideas (graphs, summaries, models, ...), should be encapsulated into text explanations. At least 3 ideas should be not just a 'copy' of the presentation notebooks.

The solutions to the tasks in practicals may be substituted by more extensive final seminar work.


## Form:
Lectures every second weeks, seminars every week.

## Oracle install:

### In the shell, run:

python -m pip install cx_Oracle --upgrade

### Download and unzip 

the Basic Package https://www.oracle.com/database/technologies/instant-client/winx64-64-downloads.html

## Add the path to the command:

cx_Oracle.init_oracle_client(config_dir=r"/home/your_username/oracle/your_config_dir")

# Basic Libraries

In [1]:
import numpy as np
import pandas as pd
import cx_Oracle
import os
import json

In [2]:
## you may try to make this run - I was not successful

#from sqlalchemy import create_engine
#e = create_engine(
#    "oracle+cx_oracle://websem:websem108@tirpitz.ms.mff.cuni.cz:1511/jedenact.ms.mff.cuni.cz", coerce_to_decimal=False)
# e.connect()

In [3]:
try:
#    cx_Oracle.init_oracle_client(config_dir="C:\\Users\\marta\\Desktop\\Plocha\\programy\\instantclient_21_8")
    connection =cx_Oracle.connect(user='websem', password='websem108', dsn='tirpitz.ms.mff.cuni.cz:1511/jedenact.ms.mff.cuni.cz')
except:
    print('Without Oracle client.')

import warnings
warnings.simplefilter("ignore")

# Data frame - our basic data structure

we use the DataFrame format from the pandas library

## Read a *.csv  file

demo of the *.csv read with the printout of the first record .head(1)

(covid data in Czech)

In [4]:
covid=pd.read_csv('data/covid.csv')
covid.head(1)

,datum,kumulativni_pocet_nakazenych,kumulativni_pocet_vylecenych,kumulativni_pocet_umrti,kumulativni_pocet_testu,kumulativni_pocet_ag_testu
0,2020-01-27,0,0,0,20,0

## Rename columns

In [5]:
namesE=['date', 'cummulative_number_of_infected', 'cummulative_number_of_healed', 
        'cummulative_number_of_dead', 'cummulative_number_of_tests', 
        'cummulative_number_of_ag_tests']
if True:
    covid.columns=namesE
covid.columns

Index(['date', 'cummulative_number_of_infected',
       'cummulative_number_of_healed', 'cummulative_number_of_dead',
       'cummulative_number_of_tests', 'cummulative_number_of_ag_tests'],
      dtype='object')

## dataFrame from scratch

you may define a dataframe directly from a dict structure

&emsp;Series

&emsp;&emsp;'column_name':[column_data]

In [6]:
my_data=pd.DataFrame({
  'age':['0-14','15-19','20-24','25-29','30-34','35-39','40-49','50-59','60-69','70-79','80 a více'],
  'male':[2299,784,854,927,1197,1329,2443,3003,4289,3322,1747],
  'female':[2159,814,950,1153,1494,1505,2627,3571,5837,5413,4094] 
})
my_data.head(1)

    age  male  female
0  0-14  2299    2159

## Data from *.json

In [7]:
movies= pd.read_json('data/movies.json')
movies.head(1)

,MOVIEID,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy\r,tt0114709,49695,45868,4,4

In [8]:
movies.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            27268, 27269, 27270, 27271, 27272, 27273, 27274, 27275, 27276,
            27277],
           dtype='int64', length=27278)

## Oracle connection
SQL language on demand, the basics: 

SELECT a keyword  
&emsp;     $*$ select all columns; a list of columns otherwise   
FROM a keyword   
&emsp;     MMOVIES table name
&emsp;&emsp; #        we could end here. We can add restrictions:  
    WHERE a keyword 
&emsp;     CNT>100 condition: column_name oprerator value  
    ORDER BY ...  
&emsp; 

Thanks to Michalovi Kopeckému for the data preparation and access.

In [9]:
try:
    movies=pd.read_sql_query('''select * from MMOVIES 
                                order by MOVIEID
                            ''', 
                             connection,index_col='MOVIEID')
except:
    movies= pd.read_json('data/movies.json')
    print('Using local data')

movies.head(1)

,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
MOVIEID,,,,,,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy\r,tt0114709,49695,45868,4,4

In [10]:
try:
    connection =cx_Oracle.connect(user='websem', password='websem108', dsn='tirpitz.ms.mff.cuni.cz:1511/jedenact.ms.mff.cuni.cz')
    ratings=pd.read_sql_query('''select * from FRATINGS 
                               where MOVIEID<20
                            ''', 
                             connection)
except:
    ratings= pd.read_json('data/ratings.json')
    print('Using local data')

In [11]:
ratings.columns

Index(['USERID', 'MOVIEID', 'RATING', 'TS', 'DT', 'TOP5', 'K', 'DTYY', 'DTMM',
       'DTDW', 'DTHH', 'KTT', 'TRAIN', 'TEST', 'DIFF'],
      dtype='object')

In [12]:
try:
    actors=pd.read_sql_query('''select ACTORS from IMDB''', connection)
except:
    actors=pd.read_json('data/actors.json')
actors

                                                  ACTORS
0                                                   None
1                                                   None
2                 Joseph Stacey, Gabi Herrett, John Grey
3      Chris Stuckmann, Fae Rie, Sam Liz, Trevor Lawr...
4                               Madison Marie Steinacker
...                                                  ...
40740  Jonnie Hurn, Chloe Farnworth, Dan Burman, Lulu...
40741  Götz George, Uwe Ochsenknecht, Christiane Hörb...
40742  Merrill Gruver, Michael Edwards, Melissa Brown...
40743  Gabrielle Anwar, Michael Schoeffling, Cliff Ro...
40744  Serdar Orçin, Zeynep Tokus, Engin Günaydin, De...

[40745 rows x 1 columns]

## Select a column of a dataframe

two alternatives

In [13]:
movies.AVG #movies['AVG']

MOVIEID
1         4
2         3
3         3
4         3
5         3
         ..
131254    4
131256    4
131258    0
131260    0
131262    0
Name: AVG, Length: 27278, dtype: int64

# DataFrame basic info

In [14]:
print("movies.shape is {}.".format(movies.shape))
print("Number of rows is {}, columns {}.".format(movies.shape[0], movies.shape[1]))

print("Column names are {}.".format(movies.columns))

print("... whithout type info {}.".format(movies.columns.tolist()))

print("movies.describe() output:")

movies.describe()

movies.shape is (27278, 7).
Number of rows is 27278, columns 7.
Column names are Index(['TITLE', 'GENRE', 'TT', 'CNT0', 'CNT', 'AVG', 'BAYESAVG'], dtype='object').
... whithout type info ['TITLE', 'GENRE', 'TT', 'CNT0', 'CNT', 'AVG', 'BAYESAVG'].
movies.describe() output:

               CNT0           CNT           AVG      BAYESAVG
count  27278.000000  27278.000000  27278.000000  27278.000000
mean     733.201224    682.430273      3.086810      3.268238
std     3057.219626   2838.253504      0.904714      0.779929
min        0.000000      0.000000      0.000000      0.000000
25%        3.000000      3.000000      3.000000      3.000000
50%       16.000000     15.000000      3.000000      3.000000
75%      194.000000    182.000000      4.000000      4.000000
max    67310.000000  62744.000000      5.000000      4.000000

## Store the dataFrame in *.json format

In [15]:
movies.reset_index(inplace=True)

In [16]:
movies

,MOVIEID,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy\r,tt0114709,49695,45868,4,4
1,2,Jumanji (1995),Adventure|Children|Fantasy\r,tt0113497,22243,20204,3,3
2,3,Grumpier Old Men (1995),Comedy|Romance\r,tt0113228,12735,11379,3,3
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance\r,tt0114885,2756,2430,3,3
4,5,Father of the Bride Part II (1995),Comedy\r,tt0113041,12161,11042,3,3
...,...,...,...,...,...,...,...,...
27273,131254,Kein Bund für's Leben (2007),Comedy\r,tt0466713,1,1,4,4
27274,131256,"Feuer, Eis & Dosenbier (2002)",Comedy\r,tt0277703,1,1,4,4
27275,131258,The Pirates (2014),Adventure\r,tt3485166,1,0,0,0
27276,131260,Rentun Ruusu (2001),(no genres listed)\r,tt0249110,1,0,0,0
27277,131262,Innocence (2014),Adventure|Fantasy|Horror\r,tt1724965,1,0,0,0

In [17]:
with open('data/movies.json', 'w') as f:
    f.write(movies.to_json())

In [18]:
movies= pd.read_json('data/movies.json')
movies.head(1)

,MOVIEID,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy\r,tt0114709,49695,45868,4,4

# We may access following tables

In [19]:
try:
    oracle_tables=pd.read_sql_query("SELECT * FROM all_tables WHERE OWNER='RULEML'", connection)
except:
    oracle_tables= pd.read_json('data/oracle.json')

### Here is the list

In [20]:
oracle_tables

,OWNER,TABLE_NAME,TABLESPACE_NAME,CLUSTER_NAME,IOT_NAME,STATUS,PCT_FREE,PCT_USED,INI_TRANS,MAX_TRANS,...,SKIP_CORRUPT,MONITORING,CLUSTER_OWNER,DEPENDENCIES,COMPRESSION,COMPRESS_FOR,DROPPED,READ_ONLY,SEGMENT_CREATED,RESULT_CACHE
0,RULEML,FUSERS,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
1,RULEML,TW_TRAINING,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
2,RULEML,FRATINGS,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
3,RULEML,FMOVIES,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
4,RULEML,MMOVIES,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
5,RULEML,MRATINGS,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
6,RULEML,DBP_KODY,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
7,RULEML,IMDB,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
8,RULEML,MUSERS,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
9,RULEML,WMOVIES,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT
10,RULEML,WUSERS,RULEML,None,None,VALID,10,None,1,255,...,DISABLED,YES,None,DISABLED,DISABLED,None,NO,NO,YES,DEFAULT

### One column list is sufficient

In [21]:
oracle_tables['TABLE_NAME']

0          FUSERS
1     TW_TRAINING
2        FRATINGS
3         FMOVIES
4         MMOVIES
5        MRATINGS
6        DBP_KODY
7            IMDB
8          MUSERS
9         WMOVIES
10         WUSERS
Name: TABLE_NAME, dtype: object

We have three sets of tables 

    M-movielense, F - netflix, W - twitter
    
with three tables in each set:

    ?MOVIES, ?RATINGS, ?USERS
    
the tables are connected by the keys MOVIEID, USERID

the movies are connected by TT with

    IMDB

## Selection criteria definition (movies with many ratings)

In [22]:
popular_crit=movies.CNT>50000
popular_crit

0        False
1        False
2        False
3        False
4        False
         ...
27273    False
27274    False
27275    False
27276    False
27277    False
Name: CNT, Length: 27278, dtype: bool

## Selection according the criterion

In [23]:
popular=movies[popular_crit]
popular

,MOVIEID,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
257,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi\r,tt0076759,54502,50180,4,4
293,296,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller\r,tt0110912,67310,62744,4,4
315,318,"Shawshank Redemption, The (1994)",Crime|Drama\r,tt0111161,63366,57486,4,4
352,356,Forrest Gump (1994),Comedy|Drama|Romance|War\r,tt0109830,66172,60572,4,4
476,480,Jurassic Park (1993),Action|Adventure|Sci-Fi|Thriller\r,tt0107290,59715,54957,4,4
587,593,"Silence of the Lambs, The (1991)",Crime|Horror|Thriller\r,tt0102926,63299,58429,4,4

In [24]:
popular.columns

Index(['MOVIEID', 'TITLE', 'GENRE', 'TT', 'CNT0', 'CNT', 'AVG', 'BAYESAVG'], dtype='object')

In [25]:
'TTT' in popular.columns

False

In [26]:
popular.TITLE  # jeden sloupec je Series

257    Star Wars: Episode IV - A New Hope (1977)
293                          Pulp Fiction (1994)
315             Shawshank Redemption, The (1994)
352                          Forrest Gump (1994)
476                         Jurassic Park (1993)
587             Silence of the Lambs, The (1991)
Name: TITLE, dtype: object

### Series index and values

In [27]:
popular.TITLE.index # Series má .index  a .values

Int64Index([257, 293, 315, 352, 476, 587], dtype='int64')

In [28]:
popular.TITLE.values

array(['Star Wars: Episode IV - A New Hope (1977)', 'Pulp Fiction (1994)',
       'Shawshank Redemption, The (1994)', 'Forrest Gump (1994)',
       'Jurassic Park (1993)', 'Silence of the Lambs, The (1991)'],
      dtype=object)

### Dataframe index and values

In [29]:
popular.index

Int64Index([257, 293, 315, 352, 476, 587], dtype='int64')

In [30]:
popular.values

array([[260, 'Star Wars: Episode IV - A New Hope (1977)',
        'Action|Adventure|Sci-Fi\r', 'tt0076759', 54502, 50180, 4, 4],
       [296, 'Pulp Fiction (1994)', 'Comedy|Crime|Drama|Thriller\r',
        'tt0110912', 67310, 62744, 4, 4],
       [318, 'Shawshank Redemption, The (1994)', 'Crime|Drama\r',
        'tt0111161', 63366, 57486, 4, 4],
       [356, 'Forrest Gump (1994)', 'Comedy|Drama|Romance|War\r',
        'tt0109830', 66172, 60572, 4, 4],
       [480, 'Jurassic Park (1993)',
        'Action|Adventure|Sci-Fi|Thriller\r', 'tt0107290', 59715, 54957,
        4, 4],
       [593, 'Silence of the Lambs, The (1991)',
        'Crime|Horror|Thriller\r', 'tt0102926', 63299, 58429, 4, 4]],
      dtype=object)

# Sequential pass through # rarely used; usually, we assign (print) as a structure

### Series

In [31]:
popular.TITLE.keys()

Int64Index([257, 293, 315, 352, 476, 587], dtype='int64')

In [32]:
popular.TITLE.items()

### for cycle in pyton syntax

In [33]:
for (key,value) in popular.TITLE.items():
    print(value)

Star Wars: Episode IV - A New Hope (1977)
Pulp Fiction (1994)
Shawshank Redemption, The (1994)
Forrest Gump (1994)
Jurassic Park (1993)
Silence of the Lambs, The (1991)

### DataFrame: Series Series

In [34]:
popular.keys()

Index(['MOVIEID', 'TITLE', 'GENRE', 'TT', 'CNT0', 'CNT', 'AVG', 'BAYESAVG'], dtype='object')

In [35]:
for (key,value) in popular.items():
    print(value)

257    260
293    296
315    318
352    356
476    480
587    593
Name: MOVIEID, dtype: int64
257    Star Wars: Episode IV - A New Hope (1977)
293                          Pulp Fiction (1994)
315             Shawshank Redemption, The (1994)
352                          Forrest Gump (1994)
476                         Jurassic Park (1993)
587             Silence of the Lambs, The (1991)
Name: TITLE, dtype: object
257             Action|Adventure|Sci-Fi\r
293         Comedy|Crime|Drama|Thriller\r
315                         Crime|Drama\r
352            Comedy|Drama|Romance|War\r
476    Action|Adventure|Sci-Fi|Thriller\r
587               Crime|Horror|Thriller\r
Name: GENRE, dtype: object
257    tt0076759
293    tt0110912
315    tt0111161
352    tt0109830
476    tt0107290
587    tt0102926
Name: TT, dtype: object
257    54502
293    67310
315    63366
352    66172
476    59715
587    63299
Name: CNT0, dtype: int64
257    50180
293    62744
315    57486
352    60572
476    54957
587    58429
Name: CNT, dtype: int64
257    4
293    4
315    4
352    4
476    4
587    4
Name: AVG, dtype: int64
257    4
293    4
315    4
352    4
476    4
587    4
Name: BAYESAVG, dtype: int64

In [36]:
'TT' in popular.keys() #set operations

True

# Slicing a DataFrame

In [37]:
# slicing by explicit index
popular['TITLE']

257    Star Wars: Episode IV - A New Hope (1977)
293                          Pulp Fiction (1994)
315             Shawshank Redemption, The (1994)
352                          Forrest Gump (1994)
476                         Jurassic Park (1993)
587             Silence of the Lambs, The (1991)
Name: TITLE, dtype: object

In [38]:
popular.TITLE   # only if 'TITLE' is a string and is not a keyword

257    Star Wars: Episode IV - A New Hope (1977)
293                          Pulp Fiction (1994)
315             Shawshank Redemption, The (1994)
352                          Forrest Gump (1994)
476                         Jurassic Park (1993)
587             Silence of the Lambs, The (1991)
Name: TITLE, dtype: object

In [39]:
popular[['TITLE','GENRE']] #list of columns

,TITLE,GENRE
257,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi\r
293,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller\r
315,"Shawshank Redemption, The (1994)",Crime|Drama\r
352,Forrest Gump (1994),Comedy|Drama|Romance|War\r
476,Jurassic Park (1993),Action|Adventure|Sci-Fi|Thriller\r
587,"Silence of the Lambs, The (1991)",Crime|Horror|Thriller\r

In [40]:
popular[popular.AVG==4]

,MOVIEID,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
257,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi\r,tt0076759,54502,50180,4,4
293,296,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller\r,tt0110912,67310,62744,4,4
315,318,"Shawshank Redemption, The (1994)",Crime|Drama\r,tt0111161,63366,57486,4,4
352,356,Forrest Gump (1994),Comedy|Drama|Romance|War\r,tt0109830,66172,60572,4,4
476,480,Jurassic Park (1993),Action|Adventure|Sci-Fi|Thriller\r,tt0107290,59715,54957,4,4
587,593,"Silence of the Lambs, The (1991)",Crime|Horror|Thriller\r,tt0102926,63299,58429,4,4

## Compound condition OR

In [41]:
popular[(popular.index <300) | (popular.index >500)]

,MOVIEID,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
257,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi\r,tt0076759,54502,50180,4,4
293,296,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller\r,tt0110912,67310,62744,4,4
587,593,"Silence of the Lambs, The (1991)",Crime|Horror|Thriller\r,tt0102926,63299,58429,4,4

## loc

reference by the index value

In [42]:
print('We locate the record by the index "{}".'.format(popular.index[2]))
popular.loc[popular.index[2]]

We locate the record by the index "315".

MOVIEID                                  318
TITLE       Shawshank Redemption, The (1994)
GENRE                          Crime|Drama\r
TT                                 tt0111161
CNT0                                   63366
CNT                                    57486
AVG                                        4
BAYESAVG                                   4
Name: 315, dtype: object

## interval reference

In [43]:
popular.loc[420:800]

,MOVIEID,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
476,480,Jurassic Park (1993),Action|Adventure|Sci-Fi|Thriller\r,tt0107290,59715,54957,4,4
587,593,"Silence of the Lambs, The (1991)",Crime|Horror|Thriller\r,tt0102926,63299,58429,4,4

## iloc  reference by the position

In [44]:
popular.iloc[0:2]

,MOVIEID,TITLE,GENRE,TT,CNT0,CNT,AVG,BAYESAVG
257,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi\r,tt0076759,54502,50180,4,4
293,296,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller\r,tt0110912,67310,62744,4,4

In [45]:
popular.iloc[:3,:4]

,MOVIEID,TITLE,GENRE,TT
257,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi\r,tt0076759
293,296,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller\r,tt0110912
315,318,"Shawshank Redemption, The (1994)",Crime|Drama\r,tt0111161

## selection of both rows and columns

In [46]:
(popular[popular.CNT>=60000])[['TITLE','CNT']]

                   TITLE    CNT
293  Pulp Fiction (1994)  62744
352  Forrest Gump (1994)  60572

# 2D array

In [47]:
popular.values

array([[260, 'Star Wars: Episode IV - A New Hope (1977)',
        'Action|Adventure|Sci-Fi\r', 'tt0076759', 54502, 50180, 4, 4],
       [296, 'Pulp Fiction (1994)', 'Comedy|Crime|Drama|Thriller\r',
        'tt0110912', 67310, 62744, 4, 4],
       [318, 'Shawshank Redemption, The (1994)', 'Crime|Drama\r',
        'tt0111161', 63366, 57486, 4, 4],
       [356, 'Forrest Gump (1994)', 'Comedy|Drama|Romance|War\r',
        'tt0109830', 66172, 60572, 4, 4],
       [480, 'Jurassic Park (1993)',
        'Action|Adventure|Sci-Fi|Thriller\r', 'tt0107290', 59715, 54957,
        4, 4],
       [593, 'Silence of the Lambs, The (1991)',
        'Crime|Horror|Thriller\r', 'tt0102926', 63299, 58429, 4, 4]],
      dtype=object)

In [48]:
popular.T

,257,293,315,352,476,587
MOVIEID,260,296,318,356,480,593
TITLE,Star Wars: Episode IV - A New Hope (1977),Pulp Fiction (1994),"Shawshank Redemption, The (1994)",Forrest Gump (1994),Jurassic Park (1993),"Silence of the Lambs, The (1991)"
GENRE,Action|Adventure|Sci-Fi\r,Comedy|Crime|Drama|Thriller\r,Crime|Drama\r,Comedy|Drama|Romance|War\r,Action|Adventure|Sci-Fi|Thriller\r,Crime|Horror|Thriller\r
TT,tt0076759,tt0110912,tt0111161,tt0109830,tt0107290,tt0102926
CNT0,54502,67310,63366,66172,59715,63299
CNT,50180,62744,57486,60572,54957,58429
AVG,4,4,4,4,4,4
BAYESAVG,4,4,4,4,4,4

In [49]:
popular.values[0]

array([260, 'Star Wars: Episode IV - A New Hope (1977)',
       'Action|Adventure|Sci-Fi\r', 'tt0076759', 54502, 50180, 4, 4],
      dtype=object)

# Data for you seminar tasks:

In [50]:
try:
    connection =cx_Oracle.connect(user='websem', password='websem108', 
                                  dsn='tirpitz.ms.mff.cuni.cz:1511/jedenact.ms.mff.cuni.cz')
    ratings=pd.read_sql_query('select * from MRATINGS WHERE MOVIEID<20 OR USERID==11',connection)
except:
    ratings= pd.read_json('data/ratings.json')
    print("Local")

ratings.head()

Local

,MOVIEID,USERID,RATING,TS,DT,TOP5,K,DTYY,DTMM,DTDW,DTHH,KTT,TRAIN,TEST,DIFF
0,1,3,4.0,944919407,944919407000,NaN,81,1999,12,7,13,81,A,N,0.0
1,1,6,5.0,858275452,858275452000,NaN,18,1997,3,5,17,18,A,N,1.0
2,1,8,4.0,833981871,833981871000,NaN,45,1996,6,4,13,45,A,N,0.0
3,1,10,4.0,943497887,943497887000,NaN,5,1999,11,5,2,5,N,A,NaN
4,1,11,4.5,1230858821,1230858821000,NaN,138,2009,1,6,1,138,A,N,0.5

In [51]:
ratings

,MOVIEID,USERID,RATING,TS,DT,TOP5,K,DTYY,DTMM,DTDW,DTHH,KTT,TRAIN,TEST,DIFF
0,1,3,4.0,944919407,944919407000,NaN,81,1999,12,7,13,81,A,N,0.0
1,1,6,5.0,858275452,858275452000,NaN,18,1997,3,5,17,18,A,N,1.0
2,1,8,4.0,833981871,833981871000,NaN,45,1996,6,4,13,45,A,N,0.0
3,1,10,4.0,943497887,943497887000,NaN,5,1999,11,5,2,5,N,A,NaN
4,1,11,4.5,1230858821,1230858821000,NaN,138,2009,1,6,1,138,A,N,0.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
267427,19,138406,4.0,1155426512,1155426512000,NaN,347,2006,8,7,23,347,A,N,1.0
267428,19,138474,5.0,966406535,966406535000,NaN,64,2000,8,4,6,64,A,N,2.0
267429,19,138483,1.0,833831393,833831393000,NaN,240,1996,6,2,19,240,A,N,-2.0
267430,19,138484,2.0,836154340,836154340000,NaN,117,1996,6,1,17,117,A,N,-1.0
267431,19,138493,4.0,1255810576,1255810576000,NaN,279,2009,10,7,20,279,A,N,1.0

In [52]:
with open('data/ratings.json', 'w') as f:
    f.write(ratings.to_json())

In [53]:
rat=pd.read_json('data/ratings.json')
rat.head()

,MOVIEID,USERID,RATING,TS,DT,TOP5,K,DTYY,DTMM,DTDW,DTHH,KTT,TRAIN,TEST,DIFF
0,1,3,4.0,944919407,944919407000,NaN,81,1999,12,7,13,81,A,N,0.0
1,1,6,5.0,858275452,858275452000,NaN,18,1997,3,5,17,18,A,N,1.0
2,1,8,4.0,833981871,833981871000,NaN,45,1996,6,4,13,45,A,N,0.0
3,1,10,4.0,943497887,943497887000,NaN,5,1999,11,5,2,5,N,A,NaN
4,1,11,4.5,1230858821,1230858821000,NaN,138,2009,1,6,1,138,A,N,0.5

In [54]:
rat.MOVIEID

0          1
1          1
2          1
3          1
4          1
          ..
267427    19
267428    19
267429    19
267430    19
267431    19
Name: MOVIEID, Length: 267432, dtype: int64

In [ ]:
rat.columns

In [ ]:
rat.shape[0]

In [ ]:
(rat[(rat.MOVIEID<20) & (rat.RATING==5)]).shape[0]

In [ ]:
rat[rat.USERID==]

# Tasks for the first seminar
1. Read the table RATINGS  (data/ratings.json or from the Oracle database).
3. Write down the list of columns. Answer with a sentence, not just the print.
4. How many rows has the dataframe?
6. How many records with MOVEID<20  and RATING==5 ?
7. Which movies are rated by the user USERID ==11 ?
8. Put your name into a markdown comment and submit the file to moodle https://dl1.cuni.cz/mod/assign/view.php?id=752106 .